ScholarMacs.org
#+TITLE: ScholarMacs
#+AUTHOR: LizardDude22
#+LANGUAGE: en 
#+PROPERTY: headger-args :tangle

* Introduction

Welcome to my Emacs config. This is literate config written in Org-mode using source code blocks tangled with a local config.el file which itself is called by .gnu-emacs-custom. To learn more about literate programming in Org-mode, or indeed literate programming in general, visit https://orgmode.org/manual/Working-with-Source-Code.html or read /Literate Programming/ by Donald Knuth.

** Packages

#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-packages

  ;;; ebib

  (use-package ebib
    :ensure t
    :config
    (setopt 
     ebib-preload-bib-files '("PLACEHOLDER")
     ebib-file-associations 
     '(("pdf" . "evince")
       ("xopp" . "xournalpp"))
     ebib-file-search-dirs '("PLACEHOLDER")
     ebib-bibtex-dialect 'biblatex
     ebib-notes-storage 'one-file-per-note
     ebib-notes-directory "PLACEHOLDER"
     ebib-reading-list-file "PLACEHOLDER"
     ebib-reading-list-template
     "** %M %T :ReadingList:\n:PROPERTIES:\n:KEY: %K\n:END:\n"
     ebib-autogenerate-keys t)

    :bind
    ("C-c e" . ebib))

  ;;; vertico

  (use-package vertico
    :ensure t
    :pin gnu
    :custom
    (vertico-cycle t)
    :init
    (vertico-mode))  ; Enable Vertico at startup

  ;;; orderless

  (use-package orderless
    :ensure t
    :pin gnu
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles basic partial-completion)))))  ;; Correct wrapping of the list

  ;;; marginalia

  (use-package marginalia
    :ensure t
    :pin gnu
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))

    :init
    (marginalia-mode))

#+END_SRC 

#+RESULTS:


This block makes sure the following packages are installed and configured:

*** Ebib

**** What does this package do?

This is an Emacs-based bibliography manager for .bib files written by Joost Kremmers—who has written an extensive accompanying manual. It support both the *BibTeX* and *BibLaTeX* dialects, and is well integrated with *org-mode*.

**** Custom settings

The /setopt/ function sets the following settings:

- preloads /PLACEHOLDER/ as a bibliographic database
- sets the following file associations:
  * .pdf : /Evince/
  * .xopp : /Xournal++/
- sets  /PLACEHOLDER/ as the associated file directory
- sets the dialect to *BibLaTeX*
- sets note storage to /one-file-per-note/
- sets the note directory to /PLACEHOLDER/
- sets the reading list file to /PLACEHOLDER/
- sets a custom reading list template
- enables Ebib's /autogenerate-keys/ function for both *BibTeX* and *BibLaTeX* entries

*** Vertico

**** What does this package do?

*Vertico,* or VERTical Interactive COmpletion, is a completion UI which replaces Emacs' builtin completion framework with a more minimalist design based on Emacs' built-in functions. *Vertico* is highly modular and can be extended with a variety of complementary packages such as *Orderless* and *Marginalia*.

*** Orderless

**** What does this package do?

*Orderless* is a completion style which matches search candidates based on fuzzy search of space-separated components

*** Marginalia

**** What does this package do?

*Marginalia* provides brief marks of annotations at the margin of the minibuffer for completion candidates in order to convey more information about files and functions.


** GNUs

#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-GNUS
    (setq gnus-select-method '(nnnil ""))  ; to disable NNTP and use no server
#+END_SRC

This block simply sets up GNUS to use no server: ideal for RSS. RSS can best be configured and filed within GNUs itself

** General Tweaks

#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-general
  ;;; Startup 
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (which-function-mode 1)

  (setopt frame-title-format "🏺 %b - ScholarMacs %M 🏺")

  ;;; Make background transparent

  ;(set-frame-parameter nil 'alpha-background 70)

  ;(add-to-list 'default-frame-alist '(alpha-background . 70))

  ;;; Toggle fullscreen

  (defun toggle-fullscreen ()
    "Toggle full screen and enable/disable battery display mode."
    (interactive)
    (set-frame-parameter
     nil 'fullscreen
     (when (not (frame-parameter nil 'fullscreen)) 'fullboth))) 
  (global-set-key (kbd "C-x <up>") 'toggle-fullscreen)


  ;;; Set up recent file and placeholder functionality

  (recentf-mode 1)
  (setq recentf-max-menu-items 10)  ; Set the maximum number of items to remember
  (global-set-key (kbd "C-x ,") 'recentf-open-files)

  (save-place-mode 1)

  ;;; Line spacing

  (setq-default line-spacing 2)

  ;;; Make scrolling bearable

  (setq pixel-scroll-precision-mode t)

  ;;; Make text nicer to read by adding margins

  (setq-default left-margin-width 5 right-margin-width 5) ; Define new widths.
  (global-visual-line-mode 1)

#+END_SRC



This block does a number of things.

- It disables the:
  * menu-bar
  * tool-bar
  * scroll-bar
- Adds an optional transparent background (commented out for now)
- Sets up a toggleable fullscreen
- Enables /recentf/ mode and binds it to /C-x ,/
- Enables /save-place-mode/
- Sets line spacing to 2
- Enables /pixel-scroll-precision-mode/ for smoother scrolling
- Adds margins

** Mode-line

