ScholarMacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-19 Wed 16:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ScholarMacs</title>
<meta name="author" content="LizardDude22" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">ScholarMacs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org877f714">1. Introduction</a>
<ul>
<li><a href="#orgec6a00b">1.1. Packages</a>
<ul>
<li><a href="#org5dc0576">1.1.1. Ebib</a></li>
<li><a href="#org184f3b6">1.1.2. Vertico</a></li>
<li><a href="#org590e510">1.1.3. Orderless</a></li>
<li><a href="#org06b86e4">1.1.4. Marginalia</a></li>
</ul>
</li>
<li><a href="#orgd9719de">1.2. GNUs</a></li>
<li><a href="#org92ac830">1.3. General Tweaks</a></li>
<li><a href="#org2e6a928">1.4. Mode-line</a>
<ul>
<li><a href="#orgf470e40">1.4.1. Mode-line Format</a></li>
<li><a href="#org21cd078">1.4.2. Indicators</a></li>
<li><a href="#org68d4d4f">1.4.3. Major Mode Icons</a></li>
</ul>
</li>
<li><a href="#orgaec715e">1.5. Custom Splashscreen</a></li>
<li><a href="#orgac64c6d">1.6. Org-mode</a>
<ul>
<li><a href="#orgd26dff4">1.6.1. Tweaks</a></li>
<li><a href="#org21e8ad3">1.6.2. Capture Templates</a></li>
<li><a href="#orga4dc0d9">1.6.3. Macros</a></li>
<li><a href="#orgd3d1cef">1.6.4. Org Babel Settings</a></li>
</ul>
</li>
<li><a href="#org4600d1d">1.7. Font settings</a></li>
<li><a href="#org26492db">1.8. Modus Theme tweaks</a></li>
<li><a href="#org7be8150">1.9. Dired settings</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org877f714" class="outline-2">
<h2 id="org877f714"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Welcome to my Emacs config. This is literate config written in Org-mode using source code blocks tangled with a local config.el file which itself is called by .gnu-emacs-custom. To learn more about literate programming in Org-mode, or indeed literate programming in general, visit <a href="https://orgmode.org/manual/Working-with-Source-Code.html">https://orgmode.org/manual/Working-with-Source-Code.html</a> or read <i>Literate Programming</i> by Donald Knuth.
</p>
</div>

<div id="outline-container-orgec6a00b" class="outline-3">
<h3 id="orgec6a00b"><span class="section-number-3">1.1.</span> Packages</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
;;; ebib

(use-package ebib
  :ensure t
  :config
  (setopt 
   ebib-preload-bib-files '("PLACEHOLDER")
   ebib-file-associations 
   '(("pdf" . "evince")
     ("xopp" . "xournalpp"))
   ebib-file-search-dirs '("PLACEHOLDER")
   ebib-bibtex-dialect 'biblatex
   ebib-notes-storage 'one-file-per-note
   ebib-notes-directory "PLACEHOLDER"
   ebib-reading-list-file "PLACEHOLDER"
   ebib-reading-list-template
   "** %M %T :ReadingList:\n:PROPERTIES:\n:KEY: %K\n:END:\n"
   ebib-autogenerate-keys t)

  :bind
  ("C-c e" . ebib))

;;; vertico

(use-package vertico
  :ensure t
  :pin gnu
  :custom
  (vertico-cycle t)
  :init
  (vertico-mode))  ; Enable Vertico at startup

;;; orderless

(use-package orderless
  :ensure t
  :pin gnu
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))  ;; Correct wrapping of the list

;;; marginalia

(use-package marginalia
  :ensure t
  :pin gnu
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))

  :init
  (marginalia-mode))

</pre>
</div>


<p>
This block makes sure the following packages are installed and configured:
</p>
</div>

<div id="outline-container-org5dc0576" class="outline-4">
<h4 id="org5dc0576"><span class="section-number-4">1.1.1.</span> Ebib</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org2b9639c"></a>What does this package do?<br />
<div class="outline-text-5" id="text-1-1-1-1">
<p>
This is an Emacs-based bibliography manager for .bib files written by Joost Kremmers—who has written an extensive accompanying manual. It support both the <b>BibTeX</b> and <b>BibLaTeX</b> dialects, and is well integrated with <b>org-mode</b>.
</p>
</div>
</li>

<li><a id="orgf54b466"></a>Custom settings<br />
<div class="outline-text-5" id="text-1-1-1-2">
<p>
The <i>setopt</i> function sets the following settings:
</p>

<ul class="org-ul">
<li>preloads <i>PLACEHOLDER</i> as a bibliographic database</li>
<li>sets the following file associations:
<ul class="org-ul">
<li>.pdf : <i>Evince</i></li>
<li>.xopp : <i>Xournal++</i></li>
</ul></li>
<li>sets  <i>PLACEHOLDER</i> as the associated file directory</li>
<li>sets the dialect to <b>BibLaTeX</b></li>
<li>sets note storage to <i>one-file-per-note</i></li>
<li>sets the note directory to <i>PLACEHOLDER</i></li>
<li>sets the reading list file to <i>PLACEHOLDER</i></li>
<li>sets a custom reading list template</li>
<li>enables Ebib's <i>autogenerate-keys</i> function for both <b>BibTeX</b> and <b>BibLaTeX</b> entries</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org184f3b6" class="outline-4">
<h4 id="org184f3b6"><span class="section-number-4">1.1.2.</span> Vertico</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="org47109ea"></a>What does this package do?<br />
<div class="outline-text-5" id="text-1-1-2-1">
<p>
<b>Vertico,</b> or VERTical Interactive COmpletion, is a completion UI which replaces Emacs' builtin completion framework with a more minimalist design based on Emacs' built-in functions. <b>Vertico</b> is highly modular and can be extended with a variety of complementary packages such as <b>Orderless</b> and <b>Marginalia</b>.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org590e510" class="outline-4">
<h4 id="org590e510"><span class="section-number-4">1.1.3.</span> Orderless</h4>
<div class="outline-text-4" id="text-1-1-3">
</div>
<ol class="org-ol">
<li><a id="org14a2056"></a>What does this package do?<br />
<div class="outline-text-5" id="text-1-1-3-1">
<p>
<b>Orderless</b> is a completion style which matches search candidates based on fuzzy search of space-separated components
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org06b86e4" class="outline-4">
<h4 id="org06b86e4"><span class="section-number-4">1.1.4.</span> Marginalia</h4>
<div class="outline-text-4" id="text-1-1-4">
</div>
<ol class="org-ol">
<li><a id="orgefd030a"></a>What does this package do?<br />
<div class="outline-text-5" id="text-1-1-4-1">
<p>
<b>Marginalia</b> provides brief marks of annotations at the margin of the minibuffer for completion candidates in order to convey more information about files and functions.
</p>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-orgd9719de" class="outline-3">
<h3 id="orgd9719de"><span class="section-number-3">1.2.</span> GNUs</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq gnus-select-method '(nnnil ""))  ; to disable NNTP and use no server
</pre>
</div>

<p>
This block simply sets up GNUS to use no server: ideal for RSS. RSS can best be configured and filed within GNUs itself
</p>
</div>
</div>

<div id="outline-container-org92ac830" class="outline-3">
<h3 id="org92ac830"><span class="section-number-3">1.3.</span> General Tweaks</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;;; Startup 
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(which-function-mode 1)

(setopt frame-title-format "🏺 %b - Λογικὴ Γραμματεύς %M 🏺")

;;; Make background transparent

;(set-frame-parameter nil 'alpha-background 70)

;(add-to-list 'default-frame-alist '(alpha-background . 70))

;;; Toggle fullscreen

(defun toggle-fullscreen ()
  "Toggle full screen and enable/disable battery display mode."
  (interactive)
  (set-frame-parameter
   nil 'fullscreen
   (when (not (frame-parameter nil 'fullscreen)) 'fullboth))) 
(global-set-key (kbd "C-x &lt;up&gt;") 'toggle-fullscreen)


;;; Set up recent file and placeholder functionality

(recentf-mode 1)
(setq recentf-max-menu-items 10)  ; Set the maximum number of items to remember
(global-set-key (kbd "C-x ,") 'recentf-open-files)

(save-place-mode 1)

;;; Line spacing

(setq-default line-spacing 2)

;;; Make scrolling bearable

(setq pixel-scroll-precision-mode t)

;;; Make text nicer to read by adding margins

(setq-default left-margin-width 5 right-margin-width 5) ; Define new widths.
(global-visual-line-mode 1)

</pre>
</div>



<p>
This block does a number of things.
</p>

<ul class="org-ul">
<li>It disables the:
<ul class="org-ul">
<li>menu-bar</li>
<li>tool-bar</li>
<li>scroll-bar</li>
</ul></li>
<li>Adds an optional transparent background (commented out for now)</li>
<li>Sets up a toggleable fullscreen</li>
<li>Enables <i>recentf</i> mode and binds it to <i>C-x ,</i></li>
<li>Enables <i>save-place-mode</i></li>
<li>Sets line spacing to 2</li>
<li>Enables <i>pixel-scroll-precision-mode</i> for smoother scrolling</li>
<li>Adds margins</li>
</ul>
</div>
</div>
