ScholarMacs.org
*** Mode-line Format


#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-mode-line-format

  (setq-default mode-line-format
		'("%e"


		  (:eval
		   (let ((mode-line-string  ; Define the mode-line-string here
				(concat
				 
				 "💾: "
				 my-mode-line-buffer-name
				 " "
				 my-mode-line-file-position
				 " "
				 my-mode-line-file-delta-status
				 " | "   ; Separator between file position and lambda symbol       
				 my-mode-line-lambda
				 my-mode-line-mode
				 (or (cdr (assoc major-mode my-major-mode-line-mode-indicators)) "")
				 " | "
				 (when which-function-mode
				   (let ((function (which-function)))
				     (if function
					 (concat function)
				       "")))
				 (when (not which-function-mode)
				   "which-function mode is disabled 👎🏻 | ")
				 )))

					 (let* ((window-width (window-width))
				(string-length (length mode-line-string))
				(total-padding (max 0 (- window-width string-length)))
				(left-padding (/ total-padding 2))  ; Integer division of total padding for left side
				(right-padding (- total-padding left-padding)))  ; The rest goes to the right

			   (concat
			    ;; Adjust the left padding slightly if there's an odd difference in padding
			    (make-string left-padding ?\s)
			    mode-line-string
			    (make-string right-padding ?\s)))))))



#+END_SRC

The block defines the mode-line format by calling the variable defined in the subsequent blocks. It then centres the mode-line.

*** Indicators

#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-mode-line-indicators

  (defvar my-mode-line-buffer-name (propertize "%b" 'face 'bold)
    "The format for the buffer name in the mode-line.")

  (defvar my-mode-line-file-position (propertize "(%o)" 'face 'shadow)
    "The format for the file position in the mode-line.")

  (defvar my-mode-line-file-delta-status (propertize "Δ: %&" 'face 'shadow))

  (defvar my-mode-line-lambda (propertize "λ " 'face 'shadow)
    "The format for the lambda symbol in the mode-line.")

  (defvar my-mode-line-mode (propertize "%m" 'face 'bold)
    "The format for the major mode in the mode-line.")

  (defvar my-mode-line-global-string (propertize " %M" 'face 'bold)
    "The format for the glboal status in the mode-line.")

#+END_SRC


This block defines the basic variables to be used as indicators within the mode-line.

*** Major Mode Icons  

#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-mode-line-major-mode-icons

  (defvar my-major-mode-line-mode-indicators
    '((org-mode . " 📚")
      (org-agenda-mode . " 🗓️")
      (bibtex-mode . " 📜")
      (lisp-mode . " 🍯")
      (python-mode . " 🐍")
      (java-mode . " ☕")
      (perl-mode . " 🐫")
      (c-mode . " 👴🏼")
      (c++-mode . " 👴🏼"))
    "A list of mode-specific indicators for the mode line.")

  #+END_SRC


This block defines a list of UTF emojis to be associated with various major mode

** Custom Splashscreen

#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-splashscreen

	(defun center-text (text)
	  "Center TEXT within the entire Emacs window width."
	  (let* ((window-width (window-body-width))          ; Get the width of the window
		 (ascii-width (apply 'max (mapcar 'length (split-string text "\n")))))  ; Max length of any line in the ASCII art
	    (if (> window-width ascii-width)
		(let ((padding (max 0 (/ (- window-width ascii-width) 2))))  ; Calculate padding
		  (mapconcat (lambda (line)
			       (concat (make-string padding ?\ ) line))  ; Add padding to each line
			     (split-string text "\n" t)
			     "\n"))
	      text)))  ; If the text is wider than the window, just return it unmodified

	(defun my-ascii-art ()
	  "Insert custom ASCII art into the *scratch* buffer."
	  (interactive)
	  (let ((ascii-art "
    _-`````-,            ,- '- .\n
  .'   .- - |          | - -.  `.\n
 /.'  /                     `.   \n
:/   :      _...   ..._      ``   :\n
::   :     /._ .`:'_.._\\.    ||   :\n
::    `._ ./  ,`  :    \\ . _.''   .\n
`:.      /   |  -.  \\-. \\\\_      /\n
  \:._ _/  .'   .@)  \\@) ` `\\ ,.'\n
     _/,--'       .- .\\,-.`--`.\n
       ,'/''     (( \\ `  )    
        /'/'  \\    `-'  (      
         '/''  `._,-----'\n
          ''/'    .,---'\n
           ''/'      ;:\n
             ''/''  ''/\n
               ''/''/''\n
                 '/'/'\n
                  `;"))
	    (let ((welcome-message "\nWelcome to ScholarMacs! Press any key to clear this scratch buffer. Credit for the art goes to Vijay Kumar Bagavath Singh <3"))
	      (with-current-buffer "*scratch*"
		(erase-buffer)
		(insert (center-text ascii-art))  ; Centered ASCII art
		(insert (center-text welcome-message))  ; Center the welcome message
		(goto-char (point-min))))))

	(add-hook 'emacs-startup-hook 'my-ascii-art)

	;; Automatically clear *scratch* buffer when you start typing
	(defvar my-scratch-cleared nil "Flag to check if *scratch* has been cleared.")

	(defun clear-scratch-buffer-on-input ()
	  "Clear the *scratch* buffer when you start typing."
	  (when (and (eq (current-buffer) (get-buffer "*scratch*"))
		     (not my-scratch-cleared)
		     (not (= (point) (point-min)))) ; Only clear if you are not at the beginning (start typing)
	    (erase-buffer)
	    (setq my-scratch-cleared t)))  ; Flag to prevent multiple clears

	(add-hook 'post-command-hook 'clear-scratch-buffer-on-input)

	;; Keep Emacs looking as usual (do not disable UI elements)
	(setq initial-buffer-choice t)

#+END_SRC 

Here the default scratch buffer is replaced with a splash screen featuring a tasteful ASCII art GNU—credited to Vijay Kumar Bagavath Singh—and a welcome message. Both the art and the message are set to clear upon user input.

** Org-mode

