ScholarMacs.html

<div id="outline-container-org2e6a928" class="outline-3">
<h3 id="org2e6a928"><span class="section-number-3">1.4.</span> Mode-line</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orgf470e40" class="outline-4">
<h4 id="orgf470e40"><span class="section-number-4">1.4.1.</span> Mode-line Format</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(setq-default mode-line-format
              '("%e"


                (:eval
                 (let ((mode-line-string  ; Define the mode-line-string here
                              (concat

                               "💾: "
                               my-mode-line-buffer-name
                               " "
                               my-mode-line-file-position
                               " "
                               my-mode-line-file-delta-status
                               " | "   ; Separator between file position and lambda symbol       
                               my-mode-line-lambda
                               my-mode-line-mode
                               (or (cdr (assoc major-mode my-major-mode-line-mode-indicators)) "")
                               " | "
                               (when which-function-mode
                                 (let ((function (which-function)))
                                   (if function
                                       (concat function)
                                     "")))
                               (when (not which-function-mode)
                                 "which-function mode is disabled 👎🏻 | ")
                               )))

                                       (let* ((window-width (window-width))
                              (string-length (length mode-line-string))
                              (total-padding (max 0 (- window-width string-length)))
                              (left-padding (/ total-padding 2))  ; Integer division of total padding for left side
                              (right-padding (- total-padding left-padding)))  ; The rest goes to the right

                         (concat
                          ;; Adjust the left padding slightly if there's an odd difference in padding
                          (make-string left-padding ?\s)
                          mode-line-string
                          (make-string right-padding ?\s)))))))



</pre>
</div>

<p>
The block defines the mode-line format by calling the variable defined in the subsequent blocks. It then centres the mode-line.
</p>
</div>
</div>

<div id="outline-container-org21cd078" class="outline-4">
<h4 id="org21cd078"><span class="section-number-4">1.4.2.</span> Indicators</h4>
<div class="outline-text-4" id="text-1-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defvar my-mode-line-buffer-name (propertize "%b" 'face 'bold)
  "The format for the buffer name in the mode-line.")

(defvar my-mode-line-file-position (propertize "(%o)" 'face 'shadow)
  "The format for the file position in the mode-line.")

(defvar my-mode-line-file-delta-status (propertize "Δ: %&amp;" 'face 'shadow))

(defvar my-mode-line-lambda (propertize "λ " 'face 'shadow)
  "The format for the lambda symbol in the mode-line.")

(defvar my-mode-line-mode (propertize "%m" 'face 'bold)
  "The format for the major mode in the mode-line.")

(defvar my-mode-line-global-string (propertize " %M" 'face 'bold)
  "The format for the glboal status in the mode-line.")

</pre>
</div>


<p>
This block defines the basic variables to be used as indicators within the mode-line.
</p>
</div>
</div>

<div id="outline-container-org68d4d4f" class="outline-4">
<h4 id="org68d4d4f"><span class="section-number-4">1.4.3.</span> Major Mode Icons</h4>
<div class="outline-text-4" id="text-1-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defvar my-major-mode-line-mode-indicators
  '((org-mode . " 📚")
    (org-agenda-mode . " 🗓️")
    (bibtex-mode . " 📜")
    (lisp-mode . " 🍯")
    (python-mode . " 🐍")
    (java-mode . " ☕")
    (perl-mode . " 🐫")
    (c-mode . " 👴🏼")
    (c++-mode . " 👴🏼"))
  "A list of mode-specific indicators for the mode line.")

</pre>
</div>


<p>
This block defines a list of UTF emojis to be associated with various major mode
</p>
</div>
</div>
</div>

<div id="outline-container-orgaec715e" class="outline-3">
<h3 id="orgaec715e"><span class="section-number-3">1.5.</span> Custom Splashscreen</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
        (defun center-text (text)
          "Center TEXT within the entire Emacs window width."
          (let* ((window-width (window-body-width))          ; Get the width of the window
                 (ascii-width (apply 'max (mapcar 'length (split-string text "\n")))))  ; Max length of any line in the ASCII art
            (if (&gt; window-width ascii-width)
                (let ((padding (max 0 (/ (- window-width ascii-width) 2))))  ; Calculate padding
                  (mapconcat (lambda (line)
                               (concat (make-string padding ?\ ) line))  ; Add padding to each line
                             (split-string text "\n" t)
                             "\n"))
              text)))  ; If the text is wider than the window, just return it unmodified

        (defun my-ascii-art ()
          "Insert custom ASCII art into the *scratch* buffer."
          (interactive)
          (let ((ascii-art "
    _-`````-,            ,- '- .\n
  .'   .- - |          | - -.  `.\n
 /.'  /                     `.   \n
:/   :      _...   ..._      ``   :\n
::   :     /._ .`:'_.._\\.    ||   :\n
::    `._ ./  ,`  :    \\ . _.''   .\n
`:.      /   |  -.  \\-. \\\\_      /\n
  \:._ _/  .'   .@)  \\@) ` `\\ ,.'\n
     _/,--'       .- .\\,-.`--`.\n
       ,'/''     (( \\ `  )    
        /'/'  \\    `-'  (      
         '/''  `._,-----'\n
          ''/'    .,---'\n
           ''/'      ;:\n
             ''/''  ''/\n
               ''/''/''\n
                 '/'/'\n
                  `;"))
            (let ((welcome-message "\nWelcome to Harry's Emacs! Press any key to clear this scratch buffer. Credit for the art goes to Vijay Kumar Bagavath Singh &lt;3"))
              (with-current-buffer "*scratch*"
                (erase-buffer)
                (insert (center-text ascii-art))  ; Centered ASCII art
                (insert (center-text welcome-message))  ; Center the welcome message
                (goto-char (point-min))))))

        (add-hook 'emacs-startup-hook 'my-ascii-art)

        ;; Automatically clear *scratch* buffer when you start typing
        (defvar my-scratch-cleared nil "Flag to check if *scratch* has been cleared.")

        (defun clear-scratch-buffer-on-input ()
          "Clear the *scratch* buffer when you start typing."
          (when (and (eq (current-buffer) (get-buffer "*scratch*"))
                     (not my-scratch-cleared)
                     (not (= (point) (point-min)))) ; Only clear if you are not at the beginning (start typing)
            (erase-buffer)
            (setq my-scratch-cleared t)))  ; Flag to prevent multiple clears

        (add-hook 'post-command-hook 'clear-scratch-buffer-on-input)

        ;; Keep Emacs looking as usual (do not disable UI elements)
        (setq initial-buffer-choice t)

</pre>
</div>

<p>
Here the default scratch buffer is replaced with a splash screen featuring a tasteful ASCII art GNU—credited to Vijay Kumar Bagavath Singh—and a welcome message. Both the art and the message are set to clear upon user input.
</p>
</div>
</div>
