ScholarMacs.org
*** Tweaks

#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-org-tweaks


  (require 'org)  ; Ensures org-mode is loaded
  (require 'oc-csl)


  ;;; Org specific files

  (setopt org-agenda-files '("PLACEHOLDER")


  ;;; Org bibliographic and exporter settings

  (setq org-cite-global-bibliography '("PLACEHOLDER")) ; Set your .bib file here

  (setq org-cite-csl-styles-dir "PLACEHOLDER") ; Set the CSL styles directory (path to where your .csl files are located)

  (setq org-cite-csl-style "PLACEHOLDER") ; Set the CSL style to the specific Harvard style you downloaded

  (setq TeX-command-default "LaTeX")
  (setq TeX-clean-confirm nil)  ; Automatically clean without confirmation
  (setq TeX-clean-intermediate-files t)  ; Automatically delete intermediate files


  ;;; Org editing and visual tweaks

  (setq-default org-toggle-pretty-entities t
		modus-themes-org-blocks 'gray-background
		org-support-shift-select t
		org-hide-emphasis-markers t
		org-startup-with-inline-images t
		org-image-actual-width '(300)
		) 
  (setopt org-image-align 'centre)  ; Or 'left or 'right

  ;;; Agenda settings	

  (global-set-key (kbd "C-c a") 'org-agenda) ; 'C-c -' Opens org-agenda
  (global-set-key (kbd "C-c t") (lambda ()           ; 'C-c 0' opens today's agenda
				  (interactive)
				  (org-agenda nil "a")))

  ;;; Activate hl-line mode in Dired and Org Agenda only

  (add-hook 'dired-mode-hook 'hl-line-mode)
  (add-hook 'org-agenda-mode-hook 'hl-line-mode)


  (font-lock-add-keywords 'org-mode
			  '(("^ *\\([-]\\) "
			     (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•")))))) ; Use only bullet point symbols for lists


  ;;; Spell checking

  (defun my/org-setup-flyspell-and-dictionary ()
    "Enable flyspell and set dictionary to British English in org-mode."
    (flyspell-mode 1)
    (setq ispell-dictionary "british"))

  (add-hook 'org-mode-hook 'my/org-setup-flyspell-and-dictionary)

  ;;; Ensure soft wrapping in org-mode

  (add-hook 'org-mode-hook (lambda () 
			     (auto-fill-mode -1)  ; Disable auto-fill
			     (setq fill-column most-positive-fixnum)  ; Disable hard wrapping
			     (visual-line-mode 1)))  ; Enable soft wrapping

#+END_SRC

*** Capture Templates

#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-fonts

  (global-set-key (kbd "C-c 9") 'org-capture) ; 'C-c 0' Opens org-capture

  (setq org-capture-templates
	'(("t" "Todo" entry (file+headline "PLACEHOLDER" "Tasks")
	   "* TODO %?\n  %i\nCreated: %T")))

#+END_SRC

*** Macros

#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-org-macros

  (defun insert-essay-plan-table ()
    "Inserts a 6x2 table for an essay plan with columns 'Idea' and 'Source', including the separator and rows."
    (interactive)
    (insert "| Idea | Source(s) (If applicable) |\n")  ; Insert the header row
    (insert "|------+---------------------------|\n")  ; Insert the separator row
    (dotimes (_ 4)  ; Create 4 additional empty rows (for a total of 6 rows)
      (insert "|      |                        |\n"))
    (org-table-align))  ; Align the table


  (global-set-key (kbd "C-c o e") 'insert-essay-plan-table)


  (defun insert-elisp-config-block()
    "Inserts an Org source block with 'emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-fonts parameters'"
    (interactive)
    (insert "#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-fonts\n#+END_SRC"))

  (defun insert-lisp-block()
    "Inserts an Org source block with 'lisp'"
    (interactive)
    (insert "#+BEGIN_SRC lisp\n#+END_SRC"))


#+END_SRC


**** Macro Table

| Name                      | Function                                                                                                    | Usage   |
|---------------------------+-------------------------------------------------------------------------------------------------------------+---------|
| insert-essay-plan-table   | "Inserts a 6x2 table for an essay plan with columns 'Idea' and 'Source', including the separator and rows." | C-c o e |
| insert-elisp-config-block | "Inserts an Org source block with 'emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-fonts parameters"                  | N/A     |
| insert-lisp-block         | "Inserts an Org source block with 'lisp'"                                                                   | N/A     |
|                           |                                                                                                             |         |


*** Org Babel Settings

#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-org-babel-settings

    (org-babel-do-load-languages
     'org-beabel-load-languages
     '((lisp . t)
       (gnuplot . t)))

#+END_SRC

#+RESULTS:


** Font settings

#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-fonts

  (set-face-attribute 'default nil :family "Dejavu Sans Mono" :height 108 :weight 'normal) ; Main typeface (for regular text)
  (set-face-attribute 'variable-pitch nil :family "Dejavu Sans" :height 1.18 :weight 'normal) ; Proportionately spaced typeface (for non-monospaced text)
  (set-face-attribute 'fixed-pitch nil :family "DejaVu Sans Mono" :height 100 :weight 'normal) ; Monospaced typeface (for fixed-pitch text, like code blocks)
  (set-face-attribute 'fixed-pitch-serif nil :family "DejaVu Sans Mono" :height 100 :weight 'normal)

  (add-hook 'org-mode-hook #'variable-pitch-mode)

#+END_SRC

** Modus Theme tweaks 

#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-modus-settings

  ;;; Simple Modus tweaks

  (setq modus-themes-fringes nil) ; Make fringes transparent
  (bind-key "<f5>" 'modus-themes-toggle) ; Day and Night mode for Emacs
  (setq modus-themes-mode-line '(accented borderless))
  (setopt modus-themes-mixed-fonts t)

  ;;; Headings for Org

  (setq modus-themes-headings
	'((1 . (height 1.4))
	  (2 . (height 1.3))
	  (3. (height 1.2))
	  (4. (height 1.1))
	  (t . (height 1))))

  ;;; Load Modus

  (load-theme 'modus-operandi t)

#+END_SRC


** Dired settings

#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-fonts

  ;; Hide file ownership/permissions by default
  (add-hook 'dired-mode-hook 'dired-hide-details-mode)

  ;; Hide dotfiles 
  (setq dired-listing-switches "-l")  ;; Use -l only, excluding -a


#+END_SRC


