ScholarMacs.html

<div id="outline-container-orgac64c6d" class="outline-3">
<h3 id="orgac64c6d"><span class="section-number-3">1.6.</span> Org-mode</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-orgd26dff4" class="outline-4">
<h4 id="orgd26dff4"><span class="section-number-4">1.6.1.</span> Tweaks</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

(require 'org)  ; Ensures org-mode is loaded
(require 'oc-csl)


;;; Org specific files

(setopt org-agenda-files '("PLACEHOLDER")


;;; Org bibliographic and exporter settings

(setq org-cite-global-bibliography '("PLACEHOLDER")) ; Set your .bib file here

(setq org-cite-csl-styles-dir "PLACEHOLDER") ; Set the CSL styles directory (path to where your .csl files are located)

(setq org-cite-csl-style "PLACEHOLDER") ; Set the CSL style to the specific Harvard style you downloaded

(setq TeX-command-default "LaTeX")
(setq TeX-clean-confirm nil)  ; Automatically clean without confirmation
(setq TeX-clean-intermediate-files t)  ; Automatically delete intermediate files


;;; Org editing and visual tweaks

(setq-default org-toggle-pretty-entities t
              modus-themes-org-blocks 'gray-background
              org-support-shift-select t
              org-hide-emphasis-markers t
              org-startup-with-inline-images t
              org-image-actual-width '(300)
              ) 
(setopt org-image-align 'centre)  ; Or 'left or 'right

;;; Agenda settings	

(global-set-key (kbd "C-c a") 'org-agenda) ; 'C-c -' Opens org-agenda
(global-set-key (kbd "C-c t") (lambda ()           ; 'C-c 0' opens today's agenda
                                (interactive)
                                (org-agenda nil "a")))

;;; Activate hl-line mode in Dired and Org Agenda only

(add-hook 'dired-mode-hook 'hl-line-mode)
(add-hook 'org-agenda-mode-hook 'hl-line-mode)


(font-lock-add-keywords 'org-mode
                        '(("^ *\\([-]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•")))))) ; Use only bullet point symbols for lists


;;; Spell checking

(defun my/org-setup-flyspell-and-dictionary ()
  "Enable flyspell and set dictionary to British English in org-mode."
  (flyspell-mode 1)
  (setq ispell-dictionary "british"))

(add-hook 'org-mode-hook 'my/org-setup-flyspell-and-dictionary)

;;; Ensure soft wrapping in org-mode

(add-hook 'org-mode-hook (lambda () 
                           (auto-fill-mode -1)  ; Disable auto-fill
                           (setq fill-column most-positive-fixnum)  ; Disable hard wrapping
                           (visual-line-mode 1)))  ; Enable soft wrapping

</pre>
</div>
</div>
</div>

<div id="outline-container-org21e8ad3" class="outline-4">
<h4 id="org21e8ad3"><span class="section-number-4">1.6.2.</span> Capture Templates</h4>
<div class="outline-text-4" id="text-1-6-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(global-set-key (kbd "C-c 9") 'org-capture) ; 'C-c 0' Opens org-capture

(setq org-capture-templates
      '(("t" "Todo" entry (file+headline "PLACEHOLDER" "Tasks")
         "* TODO %?\n  %i\nCreated: %T")))

</pre>
</div>
</div>
</div>

<div id="outline-container-orga4dc0d9" class="outline-4">
<h4 id="orga4dc0d9"><span class="section-number-4">1.6.3.</span> Macros</h4>
<div class="outline-text-4" id="text-1-6-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(defun insert-essay-plan-table ()
  "Inserts a 6x2 table for an essay plan with columns 'Idea' and 'Source', including the separator and rows."
  (interactive)
  (insert "| Idea | Source(s) (If applicable) |\n")  ; Insert the header row
  (insert "|------+---------------------------|\n")  ; Insert the separator row
  (dotimes (_ 4)  ; Create 4 additional empty rows (for a total of 6 rows)
    (insert "|      |                        |\n"))
  (org-table-align))  ; Align the table


(global-set-key (kbd "C-c o e") 'insert-essay-plan-table)


(defun insert-elisp-config-block()
  "Inserts an Org source block with 'emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-fonts parameters'"
  (interactive)
  (insert "#+BEGIN_SRC emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-fonts\n#+END_SRC"))

(defun insert-lisp-block()
  "Inserts an Org source block with 'lisp'"
  (interactive)
  (insert "#+BEGIN_SRC lisp\n#+END_SRC"))


</pre>
</div>
</div>


<ol class="org-ol">
<li><a id="orge99a5da"></a>Macro Table<br />
<div class="outline-text-5" id="text-1-6-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-left">Usage</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">insert-essay-plan-table</td>
<td class="org-left">"Inserts a 6x2 table for an essay plan with columns 'Idea' and 'Source', including the separator and rows."</td>
<td class="org-left">C-c o e</td>
</tr>

<tr>
<td class="org-left">insert-elisp-config-block</td>
<td class="org-left">"Inserts an Org source block with 'emacs-lisp :tangle ~/ScholarMacs/ScholarMacs :name config-fonts parameters"</td>
<td class="org-left">N/A</td>
</tr>

<tr>
<td class="org-left">insert-lisp-block</td>
<td class="org-left">"Inserts an Org source block with 'lisp'"</td>
<td class="org-left">N/A</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>


<div id="outline-container-orgd3d1cef" class="outline-4">
<h4 id="orgd3d1cef"><span class="section-number-4">1.6.4.</span> Org Babel Settings</h4>
<div class="outline-text-4" id="text-1-6-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(org-babel-do-load-languages
 'org-beabel-load-languages
 '((lisp . t)
   (gnuplot . t)))

</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org4600d1d" class="outline-3">
<h3 id="org4600d1d"><span class="section-number-3">1.7.</span> Font settings</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(set-face-attribute 'default nil :family "Dejavu Sans Mono" :height 108 :weight 'normal) ; Main typeface (for regular text)
(set-face-attribute 'variable-pitch nil :family "Dejavu Sans" :height 1.18 :weight 'normal) ; Proportionately spaced typeface (for non-monospaced text)
(set-face-attribute 'fixed-pitch nil :family "DejaVu Sans Mono" :height 100 :weight 'normal) ; Monospaced typeface (for fixed-pitch text, like code blocks)
(set-face-attribute 'fixed-pitch-serif nil :family "DejaVu Sans Mono" :height 100 :weight 'normal)

(add-hook 'org-mode-hook #'variable-pitch-mode)

</pre>
</div>
</div>
</div>

<div id="outline-container-org26492db" class="outline-3">
<h3 id="org26492db"><span class="section-number-3">1.8.</span> Modus Theme tweaks</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
;;; Simple Modus tweaks

(setq modus-themes-fringes nil) ; Make fringes transparent
(bind-key "&lt;f5&gt;" 'modus-themes-toggle) ; Day and Night mode for Emacs
(setq modus-themes-mode-line '(accented borderless))
(setopt modus-themes-mixed-fonts t)

;;; Headings for Org

(setq modus-themes-headings
      '((1 . (height 1.4))
        (2 . (height 1.3))
        (3. (height 1.2))
        (4. (height 1.1))
        (t . (height 1))))

;;; Load Modus

(load-theme 'modus-operandi t)

</pre>
</div>
</div>
</div>


<div id="outline-container-org7be8150" class="outline-3">
<h3 id="org7be8150"><span class="section-number-3">1.9.</span> Dired settings</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
;; Hide file ownership/permissions by default
(add-hook 'dired-mode-hook 'dired-hide-details-mode)

;; Hide dotfiles 
(setq dired-listing-switches "-l")  ;; Use -l only, excluding -a


</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: LizardDude22</p>
<p class="date">Created: 2025-02-19 Wed 16:49</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
